<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<meta name="viewpoint" content="width=device-width, initial-scale=1, shrink-to-fit=no">
 		<title>php</title>
		<link rel="stylesheet" type="text/css" href="css/style.css">
		<link rel="stylesheet" type="text/css" href="bootstrap/css/bootstrap.min.css">
	</head>

	<body>
		<header>
			

		<div class="container slider">
			<div id="carouselExampleControls" class="carousel slide" data-ride="carousel">
  				<div class="carousel-inner">
    			<div class="carousel-item active">
     			 <img src="img/main.jpg" class="d-block w-100" alt="...">
    			</div>
   				 <div class="carousel-item">
   				 	<img src="img/mem.jpg" class="d-block w-100" alt="...">
    			</div>
  				</div>
  				<a class="carousel-control-prev" href="#carouselExampleControls" role="button" data-slide="prev">
    			<span class="carousel-control-prev-icon" aria-hidden="true"></span>
    			<span class="sr-only">Previous</span>
 				 </a>
  				<a class="carousel-control-next" href="#carouselExampleControls" role="button" data-slide="next">
    			<span class="carousel-control-next-icon" aria-hidden="true"></span>
    			<span class="sr-only">Next</span>
  				</a>
			</div>
		</div>
		<div class="container">
						<p>В ночь на 11 июня Google выпустила первую публичную бета-версию операционной системы Android 11.<br>
						<br>
Новое в Android 11 Beta 1:
						<br>
						<br>
Новый раздел Conversations («Разговоры»). 
						<br>
В Android 11 разработчики полностью переосмыслили уведомления во славу удобства и простоты — вместо множества опций для отображения уведомлений три основные формы: разговоры, оповещения со звуком и беззвучные уведомления. «Разговоры», как уже было сказано, новейший раздел для объединения и группировки всех уведомлений мессенджеров и прочих коммуникационных программ вроде Android Messages, Facebook Messenger и т.д. Он находится в верхней части шторки уведомлений, аккурат под быстрыми настройками. Уведомления о новых разговорах работают по-другому, чтобы не затеряться в плотном потоке других, менее важных оповещений.
						<br>
						<br>
Функция Bubbles.
						<br>
Помимо отображения в самом верху, можно сделать так, чтобы отдельные переписки выводились в виде маленького пузыря, отображающегося поверх других запущенных приложений. Функция Bubbles работает в точности как функциональность Chat Heads в Facebook Messenger (функция дебютировала семь лет тому назад), но доступна для любого мессенджера.
						<br>
						<br>
Priority conversations («Приоритетные разговоры»). 
						<br>
Возможность помечать некоторые разговоры как «приоритетные» — изображение отправителя отображается на экране блокировки и можно через настройки добавить их в исключения, чтобы они показывались даже при активированном режиме «Не беспокоить».
						<br>
						<br>
Обновленные уведомления. 
						<br>
Android 11 приносит более простые и понятные пресеты для уведомлений со звуковым оповещением и уведомлений без звука, а также обеспечивает гибкую настройку работы этих самый уведомлений.
						<br>
						<br>
Режим Do Not Disturb («Не беспокоить»). 
						<br>
Предоставляет возможность настройки, какие приложения или контакты могут отправлять сообщения при активированном режиме.
						<br>
						<br>
Плеер в шторке уведомлений.  
						<br>
В быстрых настройках появился раздел для управления медиаконтентом.
						<br>
						<br>
Интерфейс для скриншотов. 
						<br>
С выходом Android версии 11 возможность делать «длинные» снимки экрана, которая давно присутствует на телефонах многих производителей, становится системной функцией Android. Теперь при создании скриншота окошко с ним появляется в левом нижнем углу, подобно тому, как это реализовано на iPhone.
						<br>
						<br>
Функция записи видео с экрана. 
						<br>
Еще одна функция, которая давно присутствует в оболочках сторонних производителей, наконец стала одной из стандартных возможностей на «чистом» Android.
						<br>
						<br>
Меню выключения. 
						<br>
Доступное по нажатию кнопки включения/выключения меню обновилось, появилась возможность его настройки, а также доступ к банковским картам Google Pay и управлению устройствами «умного» дома.
						<br>
						<br>
Экран с недавно запущенными приложениями. 
						<br>
Теперь на экране со списком открытых приложений в Android 11 есть кнопки «Создать скриншот», «Поделиться скриншотом» и «Выделить» для выделения текста.
						<br>
						<br>
Рекомендованные приложения. 
						<br>
В Android 11 доработали системные рекомендации приложений — в нижнем ряду на домашнем экране будут выводиться значки приложений, подобранные системой автоматически в зависимости от ситуации. Эту функцию можно отключить совсем или закрепить отдельные иконки в ряду, а остальные соответствущие алгоритмы подберут сами.
						<br>
						<br>
Разрешения. 
						<br>
В Android 11 продолжает практику затягивания ремней в отношении того, что приложения могут делать в фоновом режиме. Появилась функция сброса разрешений. Она автоматически сбрасывает все разрешения для приложений, которые долго не использовались. Кроме того, Google последовала примеру Apple с одноразовыми разрешениями на определение местоположения. Теперь, когда приложение запрашивает информацию о местоположении, всплывает окошко с тремя кнопками: «во время использования приложения», «только в этот раз» и «отклонить». Вариант «только в этот раз» — новый и он весьма кстати. Если приложению требуется постоянное разрешение, оно должно перенаправить пользователя в соответствующий раздел с настройками, чтобы он сам предоставил его. Если дважды нажать «отклонить» в окне разрешений, то Android 11 больше не позволит такому приложению запрашивать разрешение.
						<br>
						<br>
Голосовой ввод. 
						<br>
У Android есть длинный список специальных возможностей для нужд людей с особыми потребностями, а новая версия Android 11 приносит крупное обновление одной из них. Как отмечает Google, Android 11 теперь используется «зрительную кору на устройстве, которая понимает содержимое экрана и контекст, а также генерирует метки и точки доступа для соответствующих команд, активизирующих специальные возможности». Это означает, что теперь можно естественно управлять различным возможностями с помощью простых голосовых команд вместо использования не очень удобной сетки кнопок с цифрами.
						<br>
						<br>
В программе публичного бета участвуют Google Pixel всех поколений, кроме первого:
						<br>
						<br>

Pixel 2 / 2 XL
						<br>
Pixel 3a / 3a XL
						<br>
Pixel 3 / 3 XL
						<br>
Pixel 4 / 4 XL
						<br>


			</p>
		</div>

		<footer class="page-footer font-small unique-color-dark pt-0">
			<div class="primary-color">
				<div class="container">
					<div class="row py-4 d-flex align-items-center">
						<div class="col-md-6 col-lg-5 text-center text-md-left mb-4 mb-md-0">
							<h6 class="mb-0 white-text">Присоединяйтесь к нам в социальных сетях!</h6>
						</div>
					</div>
				</div>
				
			</div>
		</footer>
	</body>	

</html>	
 